Repository: shehabmohamed0/aswaq-alhelal
Catalog: root_package/lib/l10n/intl_*.arb
Languages: ar

source: Hello World!
ar: اهلا بالعالم

source: Invalid email address.
ar: البريد الإلكترونى غير صحيح.

# invalidName
source: Invalid user name.
ar: اسم المستخدم غير صحيح.

# invalidPassword
source: Password must be at least 8 character.
ar: كلمة المرور يجب ان تكون على الاقل ٨ حروف

source: Invalid phone number.
ar: رقم الهاتف غير صحيح.

# phoneNumberIsAlreadyRegistered
source: The phone number is already registered.
ar: رقم الهاتف مسجل مسبقا.

# checkInternetConnection
source: Please, check internet connection.
ar: رجاءََ٫ تفقد اتصال الانترنت.

source: Something went wrong.
ar: حدث خطأ ما.

source: Required
ar: مطلوب

source: Try again
ar: حاول مجدداََ

source: Failed to upload the image.
ar: فشل رفع الصورة

source: Failed to upload the file.
ar: فشل رفع الملف

source: Failed to upload the images.
ar: فشل رفع الصور

# mustBeAtLeastNumberCharacter
source: Must be at least {howMany, plural, one{1 character} other{{howMany} characters}}
ar: يجب ان تكون على الاقل {howMany, plural, one{حرف واحد} two{حرفين} other{{howMany} حروف}}
